tap "create-go-app/tap"
tap "encoredev/tap"
tap "felixkratz/formulae"
tap "gobuffalo/tap"
tap "imdevan/prompter"
tap "jackielii/tap"
tap "jandedobbeleer/oh-my-posh"
tap "jbreckmckye/formulae"
tap "jesseduffield/lazygit"
tap "koekeishiya/formulae"
tap "libsql/sqld"
tap "maniacsan/torrra"
tap "nikitabobko/tap"
tap "oven-sh/bun"
tap "pamburus/tap"
tap "sontek/snowmachine"
tap "tursodatabase/tap"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Arbitrary precision numeric processing language
brew "bc"
# Get/set bluetooth power and discoverable state
brew "blueutil"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Console Matrix
brew "cmatrix"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima"
# Apjanke's fork of the classic cowsay project
brew "cowsay"
# DuckDuckGo from the terminal
brew "ddgr"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Docker CLI plugin for extended build capabilities with BuildKit
brew "docker-buildx"
# Isolated development environments using Docker
brew "docker-compose"
# TUI todo manager
brew "dooit"
# Select default apps for documents and URL schemes on macOS
brew "duti"
# Easiest way to build and release mobile apps
brew "fastlane"
# Simple, fast and user-friendly alternative to find
brew "fd"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Fast and simple Node.js version manager
brew "fnm"
# Infamous electronic fortune-cookie generator
brew "fortune"
# Command-line fuzzy finder written in Go
brew "fzf"
# Interact with Google Gemini AI models from the command-line
brew "gemini-cli"
# GitHub command-line tool
brew "gh"
# Quickly rewrite git repository history
brew "git-filter-repo"
# Opinionated Go source code linter
brew "go-critic"
# Database migrations CLI tool
brew "golang-migrate"
# Fast linters runner for Go
brew "golangci-lint"
# Golang security checker
brew "gosec"
# Easy, fast, and beautiful database client for the terminal
brew "harlequin"
# Lazier way to manage everything docker
brew "lazydocker"
# Simple terminal UI for git commands
brew "lazygit"
# Rainbows and unicorns in your console!
brew "lolcat"
# CLI for MySQL with auto-completion and syntax highlighting
brew "mycli"
# Open source relational database management system
brew "mysql"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Modern shell for the GitHub era
brew "nushell"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# AI coding agent, built for the terminal
brew "opencode"
# Development kit for the Java programming language
brew "openjdk"
# Development kit for the Java programming language
brew "openjdk@17"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Fast, disk space efficient package manager
brew "pnpm"
# Modern API client that lives in your terminal
brew "posting"
# Python version management
brew "pyenv"
# Prints a steam locomotive if you type sl instead of ls
brew "sl"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Terminal multiplexer
brew "tmux"
# Find and download torrents without leaving your CLI
brew "torrra"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Pager/text based browser
brew "w3m"
# Friendly and fast tool for sending HTTP requests
brew "xh"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Create a new production-ready project with backend (Golang), frontend (JavaScript, TypeScript) and deploy automation (Ansible, Docker) by running one CLI command.
# Focus on writing code and thinking of business-logic! The CLI will take care of the rest.
brew "create-go-app/tap/cgapp"
# The static analysis-powered Go framework for building backend applications
brew "encoredev/tap/encore"
# A window border system for macOS
brew "felixkratz/formulae/borders"
# Custom macOS statusbar with shell plugin, interaction and graph support
brew "felixkratz/formulae/sketchybar"
brew "gobuffalo/tap/buffalo"
# CLI tool for assembling AI coding prompts
brew "imdevan/prompter/prompter"
# Prompt theme engine for any shell
brew "jandedobbeleer/oh-my-posh/oh-my-posh"
# Simple hotkey-daemon for macOS.
brew "koekeishiya/formulae/skhd"
# Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "oven-sh/bun/bun"
# Terminal output SVG screenshot tool
brew "pamburus/tap/termframe"
# Shiny new formula
brew "sontek/snowmachine/snowmachine"
brew "tursodatabase/tap/turso"
# AeroSpace is an i3-like tiling window manager for macOS
cask "aerospace"
# Display management tool
cask "betterdisplay"
# Terminal-based AI coding assistant
cask "claude-code"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-sauce-code-pro-nerd-font"
# Keyboard-driven, vim-like browser based on PyQt5
cask "qutebrowser"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm@nightly"
vscode "aaronyoung.dark-synthwave-vscode"
vscode "asvetliakov.vscode-neovim"
vscode "chakrounanas.turbo-console-log"
vscode "ms-python.vscode-pylance"
vscode "thang-nm.catppuccin-perfect-icons"
vscode "tinkertrain.theme-panda"
go "github.com/gobuffalo/buffalo-pop/v3"
go "fyne.io/tools/cmd/fyne"
go "golang.org/x/tools/gopls"
go "honnef.co/go/tools/cmd/staticcheck"
go "github.com/swaggo/swag/cmd/swag"
